# backend/config.py

class ModelConfig:
    IMG_HEIGHT = 40
    IMG_WIDTH = 64

# Extracted from crnn_inference_old.py
CHAR_LIST = [
    '0', '1', '2', '3', '4', '5', '6', '7', '8', '9', 'ក', 'ខ', 'គ', 'ឃ', 'ង', 'ច', 'ឆ', 'ជ', 'ឈ', 'ញ',
    'ដ', 'ឋ', 'ឌ', 'ឍ', 'ណ', 'ត', 'ថ', 'ទ', 'ធ', 'ន', 'ប', 'ផ', 'ព', 'ភ', 'ម', 'យ', 'រ', 'ល', 'វ',
    'ស', 'ហ', 'ឡ', 'អ', 'ឥ', 'ឦ', 'ឧ', 'ឩ', 'ឪ', 'ឫ', 'ឬ', 'ឭ', 'ឮ', 'ឯ', 'ឰ', 'ឱ', 'ឲ', 'ឳ',
    'ា', 'ិ', 'ី', 'ឹ', 'ឺ', 'ុ', 'ូ', 'ួ', 'ើ', 'ឿ', 'ៀ', 'េ', 'ែ', 'ៃ', 'ោ', 'ៅ', 'ំ', 'ះ', 'ៈ', '៉',
    '៊', '់', '៌', '៍', '៎', '៏', '័', '៑', '្', '។', '៕', '៖', 'ៗ', '៘', '៙', '៚', '៛',
    '០', '១', '២', '៣', '៤', '៥', '៦', '៧', '៨', '៩', '[OOV]'
]

CHAR_TO_INT = {char: i + 1 for i, char in enumerate(CHAR_LIST)}
INT_TO_CHAR = {i + 1: char for i, char in enumerate(CHAR_LIST)}
NUM_CLASSES = len(CHAR_TO_INT) + 1